In [260]:
import pandas as pd
import numpy as np

# First Question

# Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [261]:
#Reading the dataframe
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
                    'Budapest_PaRis', 'Brussels_londOn'], 
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [262]:
#type 
type(df)

pandas.core.frame.DataFrame

In [263]:
#datatype
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [265]:
#To convert FlightNumber Datatype into integer column-it will extract only the int and float columns
df.describe()

       FlightNumber
count           3.0
mean        10065.0
std            20.0
min         10045.0
25%         10055.0
50%         10065.0
75%         10075.0
max         10085.0

In [266]:
#Prseence of null values
df['FlightNumber'].isnull()

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

In [ ]:
df.FlightNumber.fillna()#not used

In [267]:
#To know the null values present  in the particular column of Dataframe
np.where(df['FlightNumber'].isnull()==True)

(array([1, 3]),)

In [268]:
#To impute the missing values with 0.0 as float datatype is given
df.FlightNumber.fillna(value=0,inplace=True)

In [269]:
#Logic to impute the missing values to increase by 10 with each row so 10055 and 10075 need to be put in place
df.FlightNumber.fillna(value=0)
for  i in range(len(df.FlightNumber)):
    if df.FlightNumber[i] == 0.0:
        df.FlightNumber[i]=df.FlightNumber[i-1]+10

/Users/rk/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [270]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
Second Way of solving the issue using the interpolation method

In [43]:
#without filling the missing values cannot convert the data type
df.astype({'FlightNumber' : 'int64'}).dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [29]:
s = pd.Series(df['FlightNumber'])
s
s.interpolate()

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [47]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Second Question

# The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [271]:
df1 = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
                    'Budapest_PaRis', 'Brussels_londOn'], 
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [272]:
df1

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [273]:
df1 = df1['From_To'].str.split(pat='_',n=1,expand=True)

In [274]:
df1

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [275]:
df1.rename(columns = {0: 'Source', 1: 'Destination'}, inplace=True)
#inplace will change in the original dataset

In [276]:
df1

     Source Destination
0    LoNDon       paris
1    MAdrid       miLAN
2    londON   StockhOlm
3  Budapest       PaRis
4  Brussels      londOn

# Third Question

# Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [277]:
df1

     Source Destination
0    LoNDon       paris
1    MAdrid       miLAN
2    londON   StockhOlm
3  Budapest       PaRis
4  Brussels      londOn

In [278]:
df1.Source = df1.Source.str.capitalize()

In [279]:
df1.Destination = df1.Destination.str.capitalize()

In [280]:
df1

     Source Destination
0    London       Paris
1    Madrid       Milan
2    London   Stockholm
3  Budapest       Paris
4  Brussels      London

In [281]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Fourth Question

# Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [286]:
result = pd.concat([df, df1],axis=1)

In [288]:
result

,From_To,FlightNumber,RecentDelays,Airline,Source,Destination
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [289]:
result.drop('From_To', axis=1, inplace=True)

In [290]:
result

   FlightNumber  RecentDelays              Airline    Source Destination
0       10045.0      [23, 47]               KLM(!)    London       Paris
1       10055.0            []    <Air France> (12)    Madrid       Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London   Stockholm
3       10075.0          [13]       12. Air France  Budapest       Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels      London

# Fiftth Question

# In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each
# second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.
# Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [291]:
result

   FlightNumber  RecentDelays              Airline    Source Destination
0       10045.0      [23, 47]               KLM(!)    London       Paris
1       10055.0            []    <Air France> (12)    Madrid       Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London   Stockholm
3       10075.0          [13]       12. Air France  Budapest       Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels      London

In [295]:
final = pd.DataFrame(result)
final

   FlightNumber  RecentDelays              Airline    Source Destination
0       10045.0      [23, 47]               KLM(!)    London       Paris
1       10055.0            []    <Air France> (12)    Madrid       Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London   Stockholm
3       10075.0          [13]       12. Air France  Budapest       Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels      London

In [300]:
df2 = pd.DataFrame(final["RecentDelays"].to_list(), columns=['delay_1', 'delay_2','delay_3'])

In [301]:
df2

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [302]:
result.drop('RecentDelays', axis=1, inplace=True)

In [303]:
df = pd.concat([df2, result],axis=1)

In [304]:
df

,delay_1,delay_2,delay_3,FlightNumber,Airline,Source,Destination
0,23.0,47.0,NaN,10045.0,KLM(!),London,Paris
1,NaN,NaN,NaN,10055.0,<Air France> (12),Madrid,Milan
2,24.0,43.0,87.0,10065.0,(British Airways. ),London,Stockholm
3,13.0,NaN,NaN,10075.0,12. Air France,Budapest,Paris
4,67.0,32.0,NaN,10085.0,"""Swiss Air""",Brussels,London